---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingDoublyConnectedError
source: html/788f5e1e-446c-3424-fd1a-06ba1afbca43.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingDoublyConnectedError Property

Railings hosted on Stairs must form a single, open, connected line.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailingDoublyConnectedError { get; }
```